# Тип 25 № 68287
# Маска числа — это последовательность цифр, в которой могут встречаться специальные символы
# «?» и «*». Символ «?» означает ровно одну произвольную цифру,
# символ «*» означает произвольную (в том числе пустую) последовательность цифр.
# Например, маске 123*4?5 соответствуют числа 123405 и 12376415.
# Найдите все натуральные числа, не превышающие 10 ** 9,
# которые соответствуют маске 3*37*3?9 и при этом без остатка делятся на 9117.
# В ответе запишите все найденные числа в порядке возрастания.
